In [1]:
import pandas as pd

In [2]:
# dataframe join is a convenient method for combining the columns of two potentially differently-indexed

In [3]:
#parameters
#1. other
#2. on
#3. how
#4. lsuffix
#5. rsuffix

In [4]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[20,30,40]})
df2 = pd.DataFrame({'C':[1,2,3],'D':[20,30,40]})

In [5]:
display(df1,df2)

   A   B
0  1  20
1  2  30
2  3  40

   C   D
0  1  20
1  2  30
2  3  40

In [6]:
df1.join(df2)

   A   B  C   D
0  1  20  1  20
1  2  30  2  30
2  3  40  3  40

In [7]:
df2.join(df1)

   C   D  A   B
0  1  20  1  20
1  2  30  2  30
2  3  40  3  40

In [10]:
#here df3 and df4 have different indexes
df3 = pd.DataFrame({'A':[1,2,3],'B':[20,30,40]},index=['a','b','c'])
df4 = pd.DataFrame({'C':[1,2,3],'D':[20,30,40]})
display(df3,df4)

   A   B
a  1  20
b  2  30
c  3  40

   C   D
0  1  20
1  2  30
2  3  40

In [11]:
df3.join(df4)

   A   B   C   D
a  1  20 NaN NaN
b  2  30 NaN NaN
c  3  40 NaN NaN

In [13]:
df4.join(df3)

   C   D   A   B
0  1  20 NaN NaN
1  2  30 NaN NaN
2  3  40 NaN NaN

In [17]:
#here no of rows are different
df5= pd.DataFrame({'A':[1,2,3],'B':[20,30,40]})
df6 = pd.DataFrame({'C':[1,2],'D':[20,30]})
df5.join(df6)  #in this case we can use how parameter

   A   B    C     D
0  1  20  1.0  20.0
1  2  30  2.0  30.0
2  3  40  NaN   NaN

In [19]:
df5.join(df6,how='right')  #adjusts data according to right dataframe index

   A   B  C   D
0  1  20  1  20
1  2  30  2  30

In [20]:
df5.join(df6,how='left')

   A   B    C     D
0  1  20  1.0  20.0
1  2  30  2.0  30.0
2  3  40  NaN   NaN

In [24]:
#when same column name in two dataframe (in this case use lsuffix and rsuffix parameter)
df5= pd.DataFrame({'A':[1,2,3],'B':[20,30,40]})
df6 = pd.DataFrame({'A':[1,2],'D':[20,30]})
df5.join(df6,lsuffix = '_1')

   A_1   B    A     D
0    1  20  1.0  20.0
1    2  30  2.0  30.0
2    3  40  NaN   NaN

In [25]:
df5.join(df6,rsuffix = '_1')

   A   B  A_1     D
0  1  20  1.0  20.0
1  2  30  2.0  30.0
2  3  40  NaN   NaN